app/controllers/expenses_controller.rb

      def create
        @expense = Expense.new(expense_params)
        @expense.author = current_user

        respond_to do |format|
          if @expense.save
---
INSERT INTO "expenses" ("name", "amount", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Oragnage"], ["amount", "2.0"], ["created_at", "2022-10-15 11:06:44.189559"], ["updated_at", "2022-10-15 11:06:44.189559"], ["author_id", 2]]