app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1 ORDER BY "groups"."name" ASC  [["user_id", 2]]
---
    def index
      @groups = current_user.groups.order(:name)

INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New AweGroup"], ["icon", nil], ["user_id", 2], ["created_at", "2022-10-15 08:31:03.506372"], ["updated_at", "2022-10-15 08:31:03.506372"]]
---
    def create
        @group = current_user.groups.new(group_params)

        respond_to do |format|
            if @group.save